; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_10_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 - counter
	)
  (:init
		(= (value c0) 83)
	(= (value c1) 73)
	(= (value c2) 54)
	(= (value c3) 50)
	(= (value c4) 67)
	(= (value c5) 16)
	(= (value c6) 84)
	(= (value c7) 15)
	(= (value c8) 3)
	(= (value c9) 76)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
		)
	)
)

; plan
1. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 3 of 9
2. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 3 of 9
3. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 3 of 9
4. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 3 of 9
5. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 3 of 9
6. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 3 of 9
7. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 3 of 9
8. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 3 of 9
9. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 3 of 9
10. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 3 of 9
11. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 3 of 9
12. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 3 of 9
13. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 3 of 9
14. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 3 of 9
15. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 3 of 9
16. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 3 of 9
17. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 3 of 9
18. (decrement c2)
   changed: (value c2) from 54 to 49
   goals met: 4 of 9
19. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 4 of 9
20. (increment c1)
   changed: (value c1) from 73 to 76
   goals met: 4 of 9
21. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 4 of 9
22. (increment c1)
   changed: (value c1) from 76 to 80
   goals met: 4 of 9
23. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 4 of 9
24. (increment c1)
   changed: (value c1) from 80 to 84
   goals met: 5 of 9
25. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 5 of 9
26. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 5 of 9
27. (increment c8)
   changed: (value c8) from 3 to 7
   goals met: 5 of 9
28. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 5 of 9
29. (increment c8)
   changed: (value c8) from 7 to 12
   goals met: 5 of 9
30. (increment c8)
   changed: (value c8) from 12 to 17
   goals met: 6 of 9
31. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 6 of 9
32. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 6 of 9
33. (increment c5)
   changed: (value c5) from 16 to 24
   goals met: 6 of 9
34. (increment c5)
   changed: (value c5) from 24 to 32
   goals met: 6 of 9
35. (increment c5)
   changed: (value c5) from 32 to 40
   goals met: 6 of 9
36. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 6 of 9
37. (increment c5)
   changed: (value c5) from 40 to 49
   goals met: 6 of 9
38. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 6 of 9
39. (increment c5)
   changed: (value c5) from 49 to 59
   goals met: 6 of 9
40. (increment c5)
   changed: (value c5) from 59 to 69
   goals met: 7 of 9
41. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 7 of 9
42. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 7 of 9
43. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 7 of 9
44. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 7 of 9
45. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 7 of 9
46. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 7 of 9
47. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 7 of 9
48. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 7 of 9
49. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 7 of 9
50. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 7 of 9
51. (increment c7)
   changed: (value c7) from 15 to 25
   goals met: 6 of 9
52. (increment c7)
   changed: (value c7) from 25 to 35
   goals met: 6 of 9
53. (increment c8)
   changed: (value c8) from 17 to 22
   goals met: 6 of 9
54. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 6 of 9
55. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 6 of 9
56. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 6 of 9
57. (increment c7)
   changed: (value c7) from 35 to 45
   goals met: 6 of 9
58. (increment c8)
   changed: (value c8) from 22 to 27
   goals met: 6 of 9
59. (increment c8)
   changed: (value c8) from 27 to 32
   goals met: 6 of 9
60. (increment c7)
   changed: (value c7) from 45 to 55
   goals met: 6 of 9
61. (decrement c6)
   changed: (value c6) from 84 to 81
   goals met: 6 of 9
62. (increment c8)
   changed: (value c8) from 32 to 37
   goals met: 6 of 9
63. (increment c8)
   changed: (value c8) from 37 to 42
   goals met: 6 of 9
64. (increment c8)
   changed: (value c8) from 42 to 47
   goals met: 6 of 9
65. (increment c8)
   changed: (value c8) from 47 to 52
   goals met: 6 of 9
66. (increment c8)
   changed: (value c8) from 52 to 57
   goals met: 7 of 9
67. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 7 of 9
68. (increment c7)
   changed: (value c7) from 55 to 65
   goals met: 6 of 9
69. (decrement c6)
   changed: (value c6) from 81 to 77
   goals met: 6 of 9
70. (increment c8)
   changed: (value c8) from 57 to 62
   goals met: 6 of 9
71. (increment c8)
   changed: (value c8) from 62 to 67
   goals met: 7 of 9
72. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 7 of 9
73. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 7 of 9
74. (increase_rate c2)
   changed: (rate_value c2) from 8 to 9
   goals met: 7 of 9
75. (increment c2)
   changed: (value c2) from 49 to 58
   goals met: 6 of 9
76. (increase_rate c2)
   changed: (rate_value c2) from 9 to 10
   goals met: 6 of 9
77. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 6 of 9
78. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 6 of 9
79. (decrement c2)
   changed: (value c2) from 58 to 48
   goals met: 7 of 9
80. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 7 of 9
81. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 7 of 9
82. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 7 of 9
83. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 7 of 9
84. (increment c7)
   changed: (value c7) from 65 to 75
   goals met: 6 of 9
85. (increment c8)
   changed: (value c8) from 67 to 72
   goals met: 6 of 9
86. (increment c8)
   changed: (value c8) from 72 to 77
   goals met: 6 of 9
87. (decrement c6)
   changed: (value c6) from 77 to 73
   goals met: 7 of 9
88. (increment c2)
   changed: (value c2) from 48 to 58
   goals met: 6 of 9
89. (increment c3)
   changed: (value c3) from 50 to 52
   goals met: 6 of 9
90. (increment c3)
   changed: (value c3) from 52 to 54
   goals met: 6 of 9
91. (increment c3)
   changed: (value c3) from 54 to 56
   goals met: 6 of 9
92. (increment c3)
   changed: (value c3) from 56 to 58
   goals met: 6 of 9
93. (increment c3)
   changed: (value c3) from 58 to 60
   goals met: 7 of 9
94. (decrement c1)
   changed: (value c1) from 84 to 74
   goals met: 6 of 9
95. (decrement c1)
   changed: (value c1) from 74 to 64
   goals met: 6 of 9
96. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 6 of 9
97. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 6 of 9
98. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 6 of 9
99. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 6 of 9
100. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 6 of 9
101. (increment c1)
   changed: (value c1) from 64 to 74
   goals met: 6 of 9
102. (decrement c0)
   changed: (value c0) from 83 to 78
   goals met: 6 of 9
103. (decrement c0)
   changed: (value c0) from 78 to 73
   goals met: 7 of 9
104. (decrement c1)
   changed: (value c1) from 74 to 64
   goals met: 6 of 9
105. (decrement c1)
   changed: (value c1) from 64 to 54
   goals met: 7 of 9
106. (decrement c0)
   changed: (value c0) from 73 to 68
   goals met: 7 of 9
107. (decrement c0)
   changed: (value c0) from 68 to 63
   goals met: 7 of 9
108. (decrement c0)
   changed: (value c0) from 63 to 58
   goals met: 7 of 9
109. (decrement c0)
   changed: (value c0) from 58 to 53
   goals met: 8 of 9
110. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 8 of 9
111. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 8 of 9
112. (increment c9)
   changed: (value c9) from 76 to 78
   goals met: 9 of 9
